	var app=angular.module("jsonapp",[]);
	app.directive("tormahiri",function(){

	return{
		restrict:'E',
		template:'بارلىق ھوقۇق تورماھىرىغا مەنسۇپ'
	}
	});
	app.controller("baxtima",function($scope,$rootScope) {
		$rootScope.headinfo="تورماھىرى تېخنىكا تورى";
		$scope.resource=[
		{img:"rasim/jsbook.jpg",
		button:"چۈشۈرۈش",link:"book/js-kollanmisi.pdf",
		title:"js قوللانمىسى ئىلان قىلىندى",descreption:"مەنزىل كىتاب تورىدىكى قىرىنداشلارنىڭ ياردەملىشىشى بىلەن js قوللانمىسنىڭ ئىلكتاب نۇسخسى ئىلان قىلىندى،تور شارائىتىڭىز ياخشى بولسا بىۋاستە مەخۇس js قوللانمىسى سەھىپىسدىن بۇ قوللانمىدىكى مەزمۇنلارنى كۆرسىڭىز بولىدۇ"}
		,{img:"rasim/blog.jpg",
		button:"زىيارەت قىلىش",link:"http://tormahiri.github.io/blog",
		title:"ماقالە سەھىپىسى يېڭىلاندى",descreption:"ماقالە سەھپىسى يېڭىچە قىياپەت بىلەن ئىچىلدى،ماقالە سەھپىسگە يېڭى مەزمۇنلار قوشۇلۇش بىلەن بىرگە كۆرۈنمە يۈزى ئازادە ۋە يانفۇنغا ماسلىشىچان قىلىپ تەڭشەلدى"},
		{img:"rasim/kolayjs.png",
		button:"ئاختۇرۇش",link:"http://tormahiri.github.io/kolayjs",
		title:"kolayjs ئىلان قىلىندى",descreption:"قولايjs بولسا  داڭلىق nodejs سۇپىسىدا يىزىلغان مودىل بولۇپ ،بۇ مودىل بىلەن سانلار گۇرۇپپىسى ۋە ھەرىپلەر تىزىمىسى شۇنداقلا ھۆججەت مەشغۇلاتى ئىلىپ بارالايمىز،تەپسىلاتنى بىلمەكچى بولسىڭىز مەخسۇس سەھىپىنى زىيارەت قىلىڭ"}
		]
			$scope.uqurlar=
		[
		{tima:"javascript بولسا ئىنتىرنىتتا ئەڭ مودا بولغان بىر قوليازما تېلى بولۇپ،بۇ ئاساسلىق توركۆرگۈچلەردە خىزمەت قىلىدۇ ،جۈملىدىن Ie ,Firefox.Safair chrome قاتارلىقلار,ئەلۋەتتە بۇيەردە بەك مۇرەككەپلەشۈرۋەتمەسلىك ئۈچۈن توركۆرگۈچتە قوللىنلىدۇ دەپ يازدىم ئەمما،بۇنىڭ قوللىنىلىش دائىرىسى تور كۆرگۈچ بىلەنلا چەكلىنىپ قالمايدۇ،بۇ تىل يەنە مۇلازىمىتىر تەرەپ پىروگىراممىسى ئۈچۈنمۇ قوللىنىلىدىغان بولۇپ ھەر تۈردىكى سانلىق مەلۇمات ئامبارلىرى بىلەن ئالاقە قىلالايدۇ،جۈملىدىن mysql,mongodb ،بۇ تىل دۇنيادىكى ئەڭ چوڭ ئىجتىمائى ئوچۇق كود سۇپىسى بولغان github دىمۇ ھەرئايلىق داڭلىق تىللارنى باھالاشتا ئالدىنقى 10 تىلنىڭ ئىچىدىكى ئورنىنى ئۈزلۈكسىز ساقلاپلا قالماي يەنە داۋاملىق ئەڭ ئالدىغا قاراپ مىڭىۋاتىدۇ،بۇ تىل بىلەن بىز ھەرخىل مۇرەككەپ ھىسابلاش مەشغۇلاتلىرىنى بىر تەرەپ قىلالايمىز،جۈملىدىن نېرۋا سىستىمىسى ۋە ماششىنا تىلىنىمۇ ئۆز ئىچىگە ئالىدۇ، سىز بۇ تىل بىلەن پروگىرامما يىزىشنى باشلاشدىن بۇرۇن چوقۇم HTML / XHTML نى بىلىشىڭىز كىرەك",img:"rasim/javascript.PNG"},
		{tima:"تور بىكىتىمىز سىزگە ئۈستەل يۈزى يۇمشاق دېتالى شۇنداقلا كۆچمە ئۈسكۈنە ئەپلىرىگە مۇناسىۋەتلىك ئىسل ماقالىلەر بىلەن تەمىنلەيدۇ،ئۇنىڭدىن باشقا توربىكەت پىروگىراممىلىرىنى ئىچىشقا مۇناسىۋەتلىك ئەمەلى كودلار ۋە قوللانمىلارنى ۋە خەلقئارادا مودا بولۇۋاتقان باشقا تېخنىكىلارغا مۇناسىۋەتلىك ئۇچۇلارنى تەمىن ئىتىدۇ،ماقالە سەھىپىسدە يۇقارقىلارغا مۇناسىۋەتلىك ئۇچۇرلارنى تاپالايسىز،توربىكىتىمىز سىزگە سىز ۋە بىز ئويلاپ باقمىغان بەزى بىر نەپلەرنى يەتكۈزگۈسى،توربىكىتىمىزدە تەمىنلەنگەن مەزمۇنلاردىن ھوزۇرلىنىش ئۈچۈن ئۈستىدكى ماس سەھىپە ئىسمنى تاللاپ زىيارەت قىىلىڭ"
		,img:"rasim/makala.PNG"},
		{tima:"توربىكىتىمىزنىڭ دەرسلىك سەھىپىسدە دۇنيادىكى ئەڭ داڭلىق دېتال ئىچىش پىروگىرامما تىللىرىنىڭ سۈرەتلىك ئۇيغۇرچە دەرسلىرى ھەقسىز تەمىنلىنىدۇ،بۇ سەھىپىدە تەمىنلەنگەن پىروگىرامما تىللىرى گوگىل شىركىتنىڭ go تىلى ۋە oracle نىڭ java پىروگىرامما تىلى شۇنداقلا php توربىكەت پىروگىرامما تىللىرى بولۇپ،ئۇنىڭدىن باشقا پىروگىرامما تىللىرىنىڭمۇ دەرسلىكلىرى پەيدىن پەي يوللىنىپ تۇرىدۇ،بۇ سەھىپىگە كىرگەندىن كىيىن ئۆزىڭىز ياقتۇرغاننىڭ ئاستىدىكى ‹‹چۈشۈرۈش››دىگەن ئۇلانمىنى بىسىپ چۈشۈرۋالسىڭىز بولىدۇ،شۇنداقلا دوستلىرىڭزغا تەۋسىيە قىلىپ قويۇشنى ئۇنۇتمىغايسىز!"
		,img:"rasim/software.png"},
		{tima:"ئەپ سەھىپىسىدە توربىكىتىمزدىكى خادىملار ئۆزى مۇستەقىلىپ تۈزۈپ چىققان ئۇيغۇرچە ئاندىرويىد ئەپلىرى تەمىنلىنىدۇ،خادىملىرىمىز تۈزۈپ چىققان بۇ ئەپلەر ھەرخىل ساھەدىكى ئۇنۋىرسال ئەپلەر بولۇپ كۆرۈنمە يۈزى يىقىشچانلىق قىلىپ لايىھەلەنگەن،ئۇنىڭدىن باشقا توربىكىتىمىز پات ئارىدا پىروگىرامما تىللىرىغا مۇناىسەتلىك ئىلىكتاب تەييارلارپ پىروگىرامما ھەۋەسكارلىرىغا ھەقسىز تەمىنلەيدۇ،سىز ۋە بىزنىڭ كۈچىشىمىزدە ئۇيغۇر يۇمشاق دېتال ساھەسى كۈچلەنگۈسى،باشقا ھەرقانداق پىكىر تەلەپلىرڭىز بولسا تەكلىپ سەھىپىسگە كىرىپ تەلىپىڭىزنى يىزىپ بىزگە ئەۋەتسىڭىز  بولىدۇ"
		,img:"rasim/app.png"}
		];
	});
